app/Http/Controllers/Auth/LoginController.php

    public function callback()
    {
        /** @var \App\User $user */
        $user = Socialite::driver('b2systems')->user();

        $new_user = User::firstOrCreate(
            ['id' => $user->id],
            ['token' => $user->token, 'name' => $user->name, 'refresh_token' => $user->refreshToken]
        );
---
select * from `users` where (`id` = '5622359a-83b8-442a-9bc1-07c7a006105a') limit 1